# EndStation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Alignment..::..EndStation Property
Alignment Class See Also
---
Specifies the station at which the alignment's geometric definition ends, in Revit internal model units (standard Imperial feet).
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public double EndStation { get; }
```

Visual Basic
---
```text
Public ReadOnly Property EndStation As Double
	Get
```

Visual C++
---
```text
public:
property double EndStation {
	double get ();
}
```

# Remarks
This station may be outside the displayed range (DisplayedStartStation, DisplayedEndStation).
# See Also
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace